# Pandas Basic

In [2]:
print('Mohit Janbandhu')

Mohit Janbandhu

- pandas -- Panel Data
- Any data used for research or study purposes
- Objects --> 1 .Series -- 1 Column Multiple rows
              2. Data Frame -- multiple rows and columns
- Built on numpy

In [8]:
import pandas as pd

# Series

In [10]:
ser= pd.Series()

C:\Users\Dell\AppData\Local\Temp\ipykernel_1672\2938155832.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  ser= pd.Series()

In [11]:
type(ser)

pandas.core.series.Series

In [12]:
dtfm= pd.DataFrame()
type(dtfm)

pandas.core.frame.DataFrame

In [13]:
ser

Series([], dtype: float64)

In [14]:
c=pd.Series(17)
c

0    17
dtype: int64

In [15]:
## Creating series using tuple
t=(10,11,12)
d=pd.Series(t)
d

0    10
1    11
2    12
dtype: int64

In [16]:
##  creating series using list
l1=[45,78,56,445,78]
d=pd.Series(l1)
d

0     45
1     78
2     56
3    445
4     78
dtype: int64

In [39]:
Ser1=pd.Series()

C:\Users\Dell\AppData\Local\Temp\ipykernel_1672\1175441265.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  Ser1=pd.Series()

In [40]:
type(Ser1)

pandas.core.series.Series

In [41]:
## Creating series with array
import numpy as np
arr=np.array([1,2,3,4])
d1=pd.Series(arr)
d1

0    1
1    2
2    3
3    4
dtype: int32

In [42]:
arr2= np.array([[1,2],[3,4],[5,6]])
arr2.shape

(3, 2)

In [44]:
arr2.ndim

2

In [45]:
## Using dictionary
d={'a':1,'b':2,'c':3,'d':4}

In [46]:
b=pd.Series(d)

In [47]:
b

a    1
b    2
c    3
d    4
dtype: int64

In [48]:
d=pd.Series([1,2,3,5,47,58,98,7,8,6,32,78,2,8,289,258,78])
print(d)#,end=" ")

0       1
1       2
2       3
3       5
4      47
5      58
6      98
7       7
8       8
9       6
10     32
11     78
12      2
13      8
14    289
15    258
16     78
dtype: int64

In [49]:
b[2]  # Using default index location

3

In [50]:
arr_2=np.array([1,2,3])
s_2=pd.Series(arr_2,index=['ab','bc','cd'])
s_2

ab    1
bc    2
cd    3
dtype: int32

In [52]:
s_2["ab"]

1

In [53]:
## Slicing operation
d=pd.Series([1,2,3,5,47,98,7,8,6,32,78,2,8,289,258,78])
d

0       1
1       2
2       3
3       5
4      47
5      98
6       7
7       8
8       6
9      32
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [54]:
d[4:9]

4    47
5    98
6     7
7     8
8     6
dtype: int64

In [55]:
d[0:13:3] # Slicing with step

0      1
3      5
6      7
9     32
12     8
dtype: int64

In [56]:
d.head()

0     1
1     2
2     3
3     5
4    47
dtype: int64

In [58]:
d.tail()

11      2
12      8
13    289
14    258
15     78
dtype: int64

In [59]:
d[[7,2,3,5]] ## extracting elements from multiple index

7     8
2     3
3     5
5    98
dtype: int64

In [60]:
d

0       1
1       2
2       3
3       5
4      47
5      98
6       7
7       8
8       6
9      32
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [61]:
d[4]=34  ## changing the element

In [62]:
d

0       1
1       2
2       3
3       5
4      34
5      98
6       7
7       8
8       6
9      32
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [63]:
d[6:10]=[100,200,300,400]

In [64]:
d

0       1
1       2
2       3
3       5
4      34
5      98
6     100
7     200
8     300
9     400
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [69]:
d

0       1
1       2
2       3
3       5
4      34
5      98
6     100
7     200
8     300
9     400
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [77]:
d1=pd.Series(d,index=[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,])

In [78]:
d1

0       1.0
1       2.0
2       3.0
3       5.0
4      34.0
5      98.0
6     100.0
7     200.0
8     300.0
9     400.0
10     78.0
11      2.0
12      8.0
13    289.0
14    258.0
15     78.0
16      NaN
dtype: float64

In [80]:
d1.index = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17]
d1

1       1.0
2       2.0
3       3.0
4       5.0
5      34.0
6      98.0
7     100.0
8     200.0
9     300.0
10    400.0
11     78.0
12      2.0
13      8.0
14    289.0
15    258.0
16     78.0
17      NaN
dtype: float64

# DataFrame

In [66]:
dtfm=pd.DataFrame()
type(dtfm)

pandas.core.frame.DataFrame

In [68]:
print(dtfm)

Empty DataFrame
Columns: []
Index: []

In [81]:
## using nested list
data=[[1,2,3,4],[14,12,1,'a',8],[7,8,9]]

In [82]:
print(type(data))

<class 'list'>

In [83]:
data=[['abc',1],['def',2],['ghi',3],['hij'],['klm','5']]

In [84]:
data

[['abc', 1], ['def', 2], ['ghi', 3], ['hij'], ['klm', '5']]

In [85]:
d= pd.DataFrame(data)

In [86]:
d

     0     1
0  abc     1
1  def     2
2  ghi     3
3  hij  None
4  klm     5

In [90]:
d.index =[1,2,3,4,5] # index name renaming

In [91]:
d

     0     1
1  abc     1
2  def     2
3  ghi     3
4  hij  None
5  klm     5

In [92]:
d=pd.DataFrame(data,columns=['A','B'],index=['A','B','C','D','E'])  ## changing the index

In [93]:
d

     A     B
A  abc     1
B  def     2
C  ghi     3
D  hij  None
E  klm     5

In [94]:
## dataframe using dictonary
data={'name':['a','b','c','d','e','f'],'age':[45,12,48,25,12,56]}

In [97]:
d= pd.DataFrame(data)  #,columns=['Name','Age'])

In [98]:
d

  name  age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f   56

In [101]:
d.rename({'name':'Name','age':"Age"},axis=1,inplace=True)

In [102]:
d

  Name  Age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f   56

In [103]:
## Accessing the elements from dataframe
data=[['ALex',10,'Maths'],['Bob',12,'Science'],['Kelly',15,'Eco'],
      ['Boris',14,'Geo'],['Ken',18,'English']]

In [104]:
data

[['ALex', 10, 'Maths'],
 ['Bob', 12, 'Science'],
 ['Kelly', 15, 'Eco'],
 ['Boris', 14, 'Geo'],
 ['Ken', 18, 'English']]

In [105]:
d=pd.DataFrame(data, columns=['Name',"Age", "Subject"])

In [106]:
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [108]:
# Accessing Single Column
d["Name"]

0     ALex
1      Bob
2    Kelly
3    Boris
4      Ken
Name: Name, dtype: object

In [109]:
## Accessing multiple column
d[['Name','Subject']]

    Name  Subject
0   ALex    Maths
1    Bob  Science
2  Kelly      Eco
3  Boris      Geo
4    Ken  English

In [110]:
d[1] ##to access single row

KeyError: 1

In [111]:
d.loc[1]

Name           Bob
Age             12
Subject    Science
Name: 1, dtype: object

In [116]:
d.iloc[2,2]

'Eco'

In [117]:
d.iloc[1,1]

12

In [118]:
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [121]:
d.loc[[0,1]]  #accessing multiple rows

   Name  Age  Subject
0  ALex   10    Maths
1   Bob   12  Science

In [122]:
# filtering data with perticular rows and column
d.loc[0:2,['Age','Subject']]
# loc takes name of columns as well upper limit

   Age  Subject
0   10    Maths
1   12  Science
2   15      Eco

In [123]:
d.iloc[1:4,[0,2]]    #iloc works only with index of column
# iloc exclude upper limit

    Name  Subject
1    Bob  Science
2  Kelly      Eco
3  Boris      Geo

In [125]:
d.iloc[1,2]

'Science'

In [124]:
d.iloc[3,1]

14

In [126]:
# to access the single element we use iloc 
d.iloc[1,2]

'Science'

In [127]:
d['Gender'] = ['M','M','F','F','F'] # initialize and add a new column to the DataFrame
d

    Name  Age  Subject Gender
0   ALex   10    Maths      M
1    Bob   12  Science      M
2  Kelly   15      Eco      F
3  Boris   14      Geo      F
4    Ken   18  English      F

In [128]:
d["Age"]= d["Age"]+2
d

    Name  Age  Subject Gender
0   ALex   12    Maths      M
1    Bob   14  Science      M
2  Kelly   17      Eco      F
3  Boris   16      Geo      F
4    Ken   20  English      F

In [129]:
d['Age']=d['Age']+ 2 # broadcasting

In [130]:
d

    Name  Age  Subject Gender
0   ALex   14    Maths      M
1    Bob   16  Science      M
2  Kelly   19      Eco      F
3  Boris   18      Geo      F
4    Ken   22  English      F

In [131]:
# Dictionary

dict1={"name":"Mohit", "surename":"Janbandhu","location":"Pune"}

In [132]:
dict1

{'name': 'Mohit', 'surename': 'Janbandhu', 'location': 'Pune'}

In [134]:
for key, value in dict1.items():
    print(key, value)

name Mohit
surename Janbandhu
location Pune

In [19]:
# Dictionary

dict1={"name":"Mohit", "surename":"Janbandhu","location":"Pune"}

In [35]:
for key, value in item(dict1):
    print(key, value)

NameError: name 'item' is not defined

In [24]:
for key, value in dict1.items():
    print(key, value)

name Mohit
surename Janbandhu
location Pune

In [26]:
dict1.keys()

dict_keys(['name', 'surename', 'location'])

In [30]:
dict1.items()

dict_items([('name', 'Mohit'), ('surename', 'Janbandhu'), ('location', 'Pune')])

In [34]:
dict1.values()

dict_values(['Mohit', 'Janbandhu', 'Pune'])

In [36]:
dict1["name"]

'Mohit'

In [37]:
dict1["name"]="Vinod"

In [38]:
dict1

{'name': 'Vinod', 'surename': 'Janbandhu', 'location': 'Pune'}